/***************************************************************************/
//              "Меркурий"-"Правда" - open source переводчик
//          распространяется в соответсвии с лицензией GNU v 2.0
//
//              файло, необходимое для работы в M$-Windows 
//     Анисимов Д.В.                                         сегодня
/***************************************************************************/

# include <core.cpp>
# include <grammar.cpp>
# include <lexer.cpp> 
# include <mylib.cpp> 
# include <quality.cpp>
# include <slowo2.cpp>
# include <slowo3.cpp>