// **************************************************************************
//               элементы несущие атомарный (неделимый смысл)
//
//            к вопросу числительному и союзу сожно пары не писать
// **************************************************************************

@Перевод
{
   @Структура2 гр_сущ_пп( число &Число ) = ;
   @Структура2 гр_сущ_пп(  род &Род, душа &Душа, падеж &Падеж, число Число ) = ;
}
@Перевод
{
   @Выбор1    гр_сущ_п ( число Число ) =
//            гр_сущ_п0( &Число )
	      гр_сущ_п1( &Число )
	      гр_сущ_п2( &Число )
	      гр_сущ_п3( &Число )
	      гр_сущ_п4( &Число )
	      гр_сущ_пп( &Число );
   @Выбор1    гр_сущ_п ( род Род, душа Душа, падеж &Падеж, число &Число ) =
              гр_сущ_п0( &Род, &Душа, Падеж, Число )
	      гр_сущ_п1( &Род, &Душа, Падеж, Число )
	      гр_сущ_п2( &Род, &Душа, Падеж, Число )
	      гр_сущ_п3( &Род, &Душа, Падеж, Число )
	      гр_сущ_п4( &Род, &Душа, Падеж, Число )
	      гр_сущ_п5( &Род, &Душа, Падеж, Число )
	      гр_сущ_п6( &Род, &Душа, Падеж, Число )
	      гр_сущ_п7( &Род, &Душа, Падеж, Число )
	      гр_сущ_п8( &Род, &Душа, Падеж, Число )
	      гр_сущ_п9( &Род, &Душа, Падеж, Число )
	      гр_сущ_пп( &Род, &Душа, Падеж, Число );
   table_chislo( Число )
}
@Перевод
{
   @Выбор1    гр_сущ_п01 ( число Число ) =
              гр_сущ_п0( &Число ) ;
   @Выбор1    гр_сущ_п01 ( род Род, душа Душа, падеж &Падеж, число &Число ) =
              гр_сущ_п0( &Род, &Душа, Падеж, Число )
	      гр_сущ_п1( &Род, &Душа, Падеж, Число )
	      гр_сущ_п2( &Род, &Душа, Падеж, Число )
	      гр_сущ_п3( &Род, &Душа, Падеж, Число )
	      гр_сущ_п4( &Род, &Душа, Падеж, Число )
	      гр_сущ_п5( &Род, &Душа, Падеж, Число )
	      гр_сущ_п6( &Род, &Душа, Падеж, Число )
	      гр_сущ_п7( &Род, &Душа, Падеж, Число )
	      гр_сущ_п8( &Род, &Душа, Падеж, Число )
	      гр_сущ_п9( &Род, &Душа, Падеж, Число )
	      гр_сущ_пп( &Род, &Душа, Падеж, Число );
   table_chislo( Число )
}
@Перевод
{
   @Структура2 гр_прил_пп = ;
   @Структура2 гр_прил_пп( род Род, душа Душа, падеж Падеж, число Число ) = ;
}
@Перевод
{
   @Выбор1    гр_прил_п =
//            гр_прил_п0
	      гр_прил_п1
	      гр_прил_п2
	      гр_прил_пп ;
   @Выбор1    гр_прил_п ( род &Род, душа &Душа, падеж &Падеж, число &Число ) =
//            гр_прил_п0( Род, Душа, Падеж, Число )
	      гр_прил_п1( Род, Душа, Падеж, Число )
	      гр_прил_п2( Род, Душа, Падеж, Число )
	      гр_прил_п3( Род, Душа, Падеж, Число )
	      гр_прил_п4( Род, Душа, Падеж, Число )
	      гр_прил_п5( Род, Душа, Падеж, Число )
	      гр_прил_п6( Род, Душа, Падеж, Число )
	      гр_прил_пп( Род, Душа, Падеж, Число ) ;
}
@Перевод
{
   @Структура2 гр_наречие_пп( смысл_наречия &Смысл ) = ;
   @Структура2 гр_наречие_пп = ;
}
@Перевод
{  // прилагательное -> наречие
   @Структура2 квази_наречие_пп( смысл_наречия &Смысл ) = ; 
   @Структура2 квази_наречие_пп = ; 
}
@Перевод
{
   @Структура1 предлог_п = @1 ;
   @Структура1 предлог_п( падеж &Падеж ) = @1 ;
}
@Перевод
{
   @Выбор Предлог = 
          предлог
	  предлог_п ;
	  
	  
   @Выбор Предлог( падеж Падеж ) = 
          предлог  ( &Падеж )
	  предлог_п( &Падеж ) ;
}
@Перевод
{
   @Структура2 гр_числ2 = ;
   @Структура2 гр_числ2( ч_падеж &ЧПадеж, ч_число &ЧЧисло, падеж &Падеж ) = ;
}
@Перевод
{
   @Структура2 фраза_пп = ;
   @Структура2 фраза_пп = ;
}
@Перевод
{
   @Структура2 фраза_прид_пп = ;
   @Структура2 фраза_прид_пп = ;
}
@Перевод
{
   @Структура2 фраза_whether_пп = ;
   @Структура2 фраза_whether_пп = ;
}
@Перевод
{
   @Структура2 фраза_have_пп = ;
   @Структура2 фраза_have_пп = ;
}
@Перевод
{
   @Структура2 фраза_have_прид_пп = ;
   @Структура2 фраза_have_прид_пп = ;
}
@Перевод
{
   @Структура2 фраза_have_whether_пп = ;
   @Структура2 фраза_have_whether_пп = ;
}
@Перевод
{
   @Выбор1     гр_глагола_п( форма Ф ) =
               гр_глагола_пп( &Ф ) ;
   @Выбор1     гр_глагола_п( verb_param ) =
               гр_глагола_П1( S,Ф,Ч,В,Р,З,П )
               гр_глагола_П2( S,Ф,Ч,В,Р,З,П )
               гр_глагола_П3( S,Ф,Ч,В,Р,З,П )
               гр_глагола_П4( S,Ф,Ч,В,Р,З,П )
               гр_глагола_п1( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п2( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п3( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п4( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п5( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п6( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_пп( S,Ф,Ч,В,Р,З,П )
	       ;
}

@Перевод
{  
   @Структура1 гр_be_пп( форма Ф ) = 
               связка[be]( &Ф ) хвост_be_a ;
   @Структура1 гр_be_пп( verb_param ) = 
               !глагол( S,Ф,@0,Ч,В,Р,%Актив,П ) хвост_be_a( Ч,Р,%Н,П ) ;
}
@Перевод
{  
   @Структура1 гр_be1_пп( форма Ф ) = 
               связка[be]( &Ф ) @1 ;
   @Структура1 гр_be1_пп( verb_param ) = 
               !глагол( S,Ф,@0,Ч,В,Р,%Актив,П ) ;
}
@Перевод
{
   @Выбор1     гр_have_п( форма Ф ) =
               гр_have_пп( &Ф ) ;
   @Выбор1     гр_have_п( verb_param ) =
               гр_глагола_П1( S,Ф,Ч,В,Р,З,П )
               гр_глагола_П2( S,Ф,Ч,В,Р,З,П )
               гр_глагола_П3( S,Ф,Ч,В,Р,З,П )
               гр_глагола_П4( S,Ф,Ч,В,Р,З,П )
               гр_глагола_п1( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п2( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п3( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п4( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п5( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_п6( S,Ф,Ч,В,Р,З,П )
	       гр_глагола_пп( S,Ф,Ч,В,Р,З,П )
	       ;
}

