// **************************************************************************
//                          расчлененные вопросы
//
// **************************************************************************

@Перевод
{
   @Выбор     рв_глагол =
              @0[do]   @0[does] @0[did]
	      @0[have] @0[has]  @0[had]
	      _связка_is
	      _связка_was
	      @0[can] @0[will] @0[must]
	      @0[may] @0[need] @0[ought]
	      ;
   @Выбор     рв_глагол =
              @0[_] @0[_] @0[_]
              @0[_] @0[_] @0[_]
              @0[_] 
	      @0[_]
              @0[_] @0[_] @0[_]
              @0[_] @0[_] @0[_]
	      ;
}
@Перевод
{
   @Выбор     рв_местоимение =
              @0[he] @0[i] @0[it] @0[she] @0[they] @0[we] @0[you] ;
   @Выбор     рв_местоимение =
	      @0[_]  @0[_] @0[_]  @0[_]   @0[_]    @0[_]  @0[_] ;
}
@Перевод
{
   @Структура рв_вопрос1 = рв_глагол _Not рв_местоимение ;
   @Структура рв_вопрос1 = @0[не_правда_ли] ; 
}
