
   @Формат глагол формат1
   {
      Форма=Inf   @Слово
      Форма=FormS @Слово
      Форма=Form2 @Слово
      Форма=Form3 @Слово
      Форма=Ing   @Слово
   }
   @Формат частица формат1_2
   {
      Форма=Inf   @Слово
      Форма=FormS @Слово
      Форма=Form2 @Слово
      Форма=Form3 @Слово
      Форма=Ing   @Слово
   }
   @Формат связка формат1_3
   {
      Форма=Смысл @Слово
      Форма=Inf   @Слово
      Форма=FormS @Слово
      Форма=Form2 @Слово
      Форма=Form3 @Слово
      Форма=Ing   @Слово
   }

   @Формат мод_глагол формат5
   {  Форма=Inf   @Слово
      Форма=Form2 @Слово
   }

   @Формат сущ формат2
   {  Число = Ед  @Слово
      Число = Мн  @Слово
   }
