# define pril_chislo_rod \
      {  Число=Ед        \
	 {  Род=М @Слово \
	    Род=Ж @Слово \
	    Род=С @Слово \
	 }               \
	 Число=Мн @Слово \
      }

   @Формат глагол формат1
   {  СС=Несов
      Форма=Inf @Слово
      Форма=глагол
      {  Залог=Актив
         Время=настоящее
	 {  Число=Ед {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	    Число=Мн {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	 }
	 Время=прошлое
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
	 Залог=Пассив
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
	 Залог=Повелит
	 {  Число=Ед  @Слово  Число=Мн  @Слово  }
      }
      Форма=причастие
      {  Время=настоящее
	 {  Падеж=И pril_chislo_rod
	    Падеж=Р pril_chislo_rod
	    Падеж=Д pril_chislo_rod
	    Падеж=В pril_chislo_rod
	    Падеж=Т pril_chislo_rod
	    Падеж=П pril_chislo_rod
	 }
	 Время=прошлое
	 {  Падеж=И pril_chislo_rod
	    Падеж=Р pril_chislo_rod
	    Падеж=Д pril_chislo_rod
	    Падеж=В pril_chislo_rod
	    Падеж=Т pril_chislo_rod
	    Падеж=П pril_chislo_rod
	 }
      }
      Форма=деепричастие @Слово
      СС=Сов
      Форма=Inf @Слово
      Форма=глагол
      {  Залог=Актив
         Время=будущее
	 {  Число=Ед {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	    Число=Мн {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	 }
	 Время=прошлое
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
	 Залог=Пассив
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
	 Залог=Повелит
	 {  Число=Ед  @Слово  Число=Мн  @Слово  }
      }
      Форма=причастие
      {
	 Время=прошлое
	 {  Падеж=И pril_chislo_rod
	    Падеж=Р pril_chislo_rod
	    Падеж=Д pril_chislo_rod
	    Падеж=В pril_chislo_rod
	    Падеж=Т pril_chislo_rod
	    Падеж=П pril_chislo_rod
	 }
      }
      Форма=деепричастие @Слово
   }
   @Формат мод_глагол формат1a
   {  СС=Несов
      Форма=Inf @Слово
      Форма=глагол
      {  Время=настоящее
	 {  Число=Ед {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	    Число=Мн {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	 }
	 Время=прошлое
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
      }
      СС=Сов
      Форма=Inf @Слово
      Форма=глагол
      {  Время=будущее
	 {  Число=Ед {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	    Число=Мн {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	 }
	 Время=прошлое
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
      }
   }
   @Формат мод_глагол формат1б
   {  СС=Несов
      Форма=Inf @Слово
      Форма=глагол
      {  Время=настоящее
	 {  Число=Ед {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	    Число=Мн {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	 }
	 Время=прошлое
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
      }
      СС=Сов
      Форма=Inf @Слово
      Форма=глагол
      {  Время=будущее
	 {  Число=Ед {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	    Число=Мн {  Лицо=1е @Слово  Лицо=2е @Слово  Лицо=3е @Слово  }
	 }
	 Время=прошлое
	 {  Число=Ед {  Род=М @Слово  Род=Ж @Слово  Род=С @Слово  }
	    Число=Мн  @Слово
	 }
      }
   }

   @Формат сущ формат2
   {  
      Число=Ед
      {  Падеж=И @Слово  Падеж=Р @Слово
	 Падеж=Д @Слово  Падеж=В @Слово
	 Падеж=Т @Слово  Падеж=П @Слово
      }
      Число=Мн
      {  Падеж=И @Слово  Падеж=Р @Слово
	 Падеж=Д @Слово  Падеж=В @Слово
	 Падеж=Т @Слово  Падеж=П @Слово
      }
   }
   @Формат прил формат3_1
   {
      Падеж=И        pril_chislo_rod
      Падеж=Р        pril_chislo_rod
      Падеж=Д        pril_chislo_rod
      Падеж=В Душа=Н pril_chislo_rod
      Падеж=В Душа=О pril_chislo_rod
      Падеж=Т        pril_chislo_rod
      Падеж=П        pril_chislo_rod
   }
   @Формат прил формат3
   {
      Падеж=И pril_chislo_rod
      Падеж=Р pril_chislo_rod
      Падеж=Д pril_chislo_rod
      Падеж=В pril_chislo_rod
      Падеж=Т pril_chislo_rod
      Падеж=П pril_chislo_rod
   }
   @Формат числительное формат4
   {
      Падеж=И @Слово
      Падеж=Р @Слово
      Падеж=Д @Слово
      Падеж=В @Слово
      Падеж=Т @Слово
      Падеж=П @Слово

   }
   @Формат мест_сущ1 формат4_1
   {
      Падеж=И @Слово
      Падеж=Р @Слово
      Падеж=Д @Слово
      Падеж=В @Слово
      Падеж=Т @Слово
      Падеж=П @Слово

   }
   @Формат мест_сущ2 формат4_2
   {
      Падеж=И @Слово
      Падеж=Р @Слово
      Падеж=Д @Слово
      Падеж=В @Слово
      Падеж=Т @Слово
      Падеж=П @Слово

   }
   @Формат мест_сущ3 формат4_3
   {
      Падеж=И @Слово
      Падеж=Р @Слово
      Падеж=Д @Слово
      Падеж=В @Слово
      Падеж=Т @Слово
      Падеж=П @Слово

   }
   @Формат частица формат5
   {
      Присутствие=Да  @Слово
      Присутствие=Нет @Слово
   }

